app/controllers/lists_controller.rb

INSERT INTO "lists" ("list_name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["list_name", ""], ["description", ""], ["created_at", "2017-10-27 13:11:17.977799"], ["updated_at", "2017-10-27 13:11:17.977799"]]
---
	def create
		@list=List.new(list_params)

		if @list.save

UPDATE "lists" SET "list_name" = ?, "due_date" = ?, "description" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["list_name", "can't not delete"], ["due_date", "2016-03-03"], ["description", "this can't delete"], ["updated_at", "2017-10-27 13:17:28.327787"], ["id", 11]]
---
	def update
		if @list.update_attributes(list_params)

UPDATE "lists" SET "finished" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["finished", "f"], ["updated_at", "2017-10-27 14:29:50.072666"], ["id", 5]]
---
	def finished
		if @list.finished == false
			@list.finished = true
		else
			@list.finished = false
		end

		@list.save

DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 8]]
---
	def destroy
		if @list.due_date < current
			redirect_to lists_url, alert: "This item can not to delete. Because is over due date."
		else
		@list.destroy

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
	def set_list
		@list=List.find(params[:id])